// 1. Дана строка 'aaa@bbb@ccc'. Замените все @ на ! с помощью глобального
// поиска и замены.

// let str = 'aaa@bbb@ccc';

// console.log(str.replace(/@/g, '!'));

// 2. В переменной date лежит дата в формате 2025-12-31. Преобразуйте эту
// дату в формат 31/12/2025.

// let date = new Date('2025-12-31');
// console.log(date.toLocaleDateString('en-GB')); 

// 3. Дана строка «Я учу javascript!». Вырежете из нее слово «учу» и слово
// «javascript» тремя разными способами (через substr, substring, slice).

// let str = 'Я учу javascript!';
// console.log(str.substr(0, 1));
// console.log(str.substring(0, 1));
// console.log(str.slice(0, 1));

// 4. Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень
// из суммы кубов его элементов. Для решения воспользуйтесь циклом for.

// let arr = [4, 2, 5, 19, 13, 0, 10];
// let sum = 0;

// for(let i = 0; i < arr.length; i++) {
//     sum += Math.pow(arr[i], 3);
// }

// console.log(Math.sqrt(sum));

// 5. Даны переменные a и b. Отнимите от a переменную b и результат
// присвойте переменной c. Сделайте так, чтобы в любом случае в переменную
// c записалось положительное значение. Проверьте работу скрипта при a и b,
// равных соответственно 3 и 5, 6 и 1.

// let a = 3,
//     b = 5,
//     c = Math.abs(a - b);

// console.log(c);

// 6. Выведите на экран текущую дату-время в формате 12:59:59 31.12.2014.
// Для решения этой задачи напишите функцию, которая будет добавлять 0
// перед днями и месяцами, которые состоят из одной цифры (из 1.9.2014
// сделает 01.09.2014).

// let dateNow = new Date();
 
// function format(item){
//     if (item > 0 && item < 10) { 
//         return '0' + item;
//     } else return item;
// }

// console.log(format(dateNow.getHours()) + ':' + format(dateNow.getMinutes()) + ':' + format(dateNow.getSeconds()) + ' ' + format(dateNow.getDate()) + '.' + format(dateNow.getMonth()) + '.' + format(dateNow.getFullYear()));

// 7. Дана строка 'aa aba abba abbba abca abea'. Напишите регулярку, которая
// найдет строки aba, abba, abbba по шаблону: буква 'a', буква 'b' любое
// количество раз, буква 'a'.

// let str = 'aa aba abba abbba abca abea';

// console.log(str.replace(/ab+a/g, '*'));

// 8. Напишите ф-цию строгой проверки ввода номер телефона в
// международном формате (<код страны> <код города или сети> <номер
// телефона>). Функция должна возвращать true или false. Используйте
// регулярные выражения.

// const check = function(tel) {
//     if (tel.search(/\+\d{3}\(?[0-9]{2}\)?\d{3}\-?\d{2}\-?\d{2}/) != -1) {
//         return true;
//     } else return false;
// }

// console.log(check('+375(33)337-94-95'));

// 9. Напишите ф-цию строгой проверки адреса эл. почты с учетом следующих
// условия:
// - весь адрес не должен содержать русские буквы и спецсимволы, кроме
// одной «собачки», знака подчеркивания, дефиса и точки;
// - имя эл. почты (до знака @) должно быть длиной более 2 символов, причем
// имя может содержать только буквы, цифры, но не быть первыми и
// единственными в имени;
// - после последней точки и после @, домен верхнего уровня (ru, by, com и т.п.)
// не может быть длиной менее 2 и более 11 символов.
// Функция должна возвращать true или false. Используйте регулярные
// выражения.

// const emailValidator = function(email) {
//     let regex = /^([a-z0-9_-]+\.)*[a-z0-9_-]+@[a-z0-9_-]+(\.[a-z0-9_-]+)*\.[a-z]{2,6}$/;
//     return regex.test(email);
// };
    
// console.log(emailValidator('alex-miha@tut.by'));

